pract_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ali"], ["age", 33], ["created_at", "2023-06-11 12:15:04.694779"], ["updated_at", "2023-06-11 12:15:04.694779"]]
---
def create
    user=User.new(user_params)
    if user.save!

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "age" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["age", 31], ["updated_at", "2023-06-11 12:23:55.900797"], ["id", 1]]
---
def update
    user=User.find(params[:id])
    if user.update(user_params)

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
def destroy
    users=User.all
    user=User.find(params[:id])
    if user.delete